Documents/ЗакрытиеАктаТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗакрытиеАктаТП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакрытиеПоСотрудникам</xr:Item>
				<xr:Item>AccumulationRegister.ПланТиражныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТирАиП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АктТиражногоПодразделения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПланТиражныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ПланТиражныхРабот</Name>
			<Comment>Для контроля остатков работ по тиражныхм планам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПланРаботТиражный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦенаФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТирАиП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТирАиП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗакрытиеПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ЗакрытиеПоСотрудникам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение - источник средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗакрытиеАктаТП/Ext/ObjectModule.bsl
// проверка после проведения документов
// -закрытие актов тиражных работ 
// -закрытие тиражных проектов
Функция ОстаткиПоПлануТР() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗакрытиеАТП.Номенклатура,
		|	ЗакрытиеАТП.Цена,
		|	ЗакрытиеАТП.ЦенаФОТ
		|ПОМЕСТИТЬ ВТНоменклатураЦены
		|ИЗ
		|	Документ.ЗакрытиеАктаТП.ФизическиеЛица КАК ЗакрытиеАТП
		|ГДЕ
		|	ЗакрытиеАТП.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиПТР.Номенклатура,
		|	ОстаткиПТР.Цена,
		|	ОстаткиПТР.ЦенаФОТ,
		|	СУММА(ОстаткиПТР.КоличествоОстаток) КАК Остаток
		|ИЗ
		|	ВТНоменклатураЦены КАК ВТНоменклатураЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланТиражныхРабот.Остатки(, ПланРаботТиражный = &ПланРаботТиражный) КАК ОстаткиПТР
		|		ПО ВТНоменклатураЦены.Номенклатура = ОстаткиПТР.Номенклатура
		|			И ВТНоменклатураЦены.Цена = ОстаткиПТР.Цена
		|			И ВТНоменклатураЦены.ЦенаФОТ = ОстаткиПТР.ЦенаФОТ
		|ГДЕ
		|	ОстаткиПТР.КоличествоОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПТР.Номенклатура,
		|	ОстаткиПТР.Цена,
		|	ОстаткиПТР.ЦенаФОТ";

	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ПланРаботТиражный", 	АктТиражногоПодразделения.ПланРабот);
	//

	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;

КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	//
	ПланРабот = АктТиражногоПодразделения.ПланРабот;
	
	Если НЕ РазрешеноПроводитьДокумент( Ссылка, ПланРабот.ЗадачаПроекта.Владелец ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	
	Если 	ФизическиеЛица.Количество() = 0 
	или		ФизическиеЛица.Итог("Количество")=0 
	или		ФизическиеЛица.Итог("Сумма")=0 Тогда
		Сообщение 		= Новый СообщениеПользователю;
        Сообщение.Текст = "Не заполнена табличная часть";
        Сообщение.Сообщить();

        Отказ = Истина;      
		Возврат;
	КонецЕсли;
	
	
	// 2014
	// новый регистр взамен ОстаткиАктов и Остатк Лимита
	Движения.ОстаткиТирАиП.Записывать = Истина;
	Для Каждого ТекСтрока Из ФизическиеЛица Цикл
		Движение = Движения.ОстаткиТирАиП.Добавить();
		Движение.ВидДвижения 				= ВидДвиженияНакопления.Расход;
		Движение.Период 					= Дата;
		Движение.Источник 					= АктТиражногоПодразделения;
		Движение.ПланРабот 					= ПланРабот;
		//
		Движение.Сумма 						= ТекСтрока.Сумма;
	КонецЦикла;
	

	// регистр ЗакрытиеПоСотрудникам 
	Движения.ЗакрытиеПоСотрудникам.Записывать = Истина;
	Для Каждого ТекСтрока Из ФизическиеЛица Цикл
		Движение = Движения.ЗакрытиеПоСотрудникам.Добавить();
		Движение.Период 		= Дата;
		Движение.ФизическоеЛицо = ТекСтрока.ФизическоеЛицо;
		Движение.Источник 		= АктТиражногоПодразделения;
		Движение.Подразделение 	= АктТиражногоПодразделения.Подразделение;
		Движение.ПланРабот 		= ПланРабот;
		Движение.Сумма 			= ТекСтрока.Сумма;
	КонецЦикла;

	// регистр ПланТиражныхРабот Расход
	Если ЗначениеЗаполнено( ПланРабот ) Тогда
		тзЗакрытие = ФизическиеЛица.Выгрузить();
		тзЗакрытие.Свернуть("Номенклатура,Цена,ЦенаФОТ", "Количество,Скидка");
		Движения.ПланТиражныхРабот.Записывать = Истина;
		Для Каждого СтрТЗ Из тзЗакрытие Цикл
			Движение = Движения.ПланТиражныхРабот.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 			= Дата;
			//
			Движение.ПланРаботТиражный 	= АктТиражногоПодразделения.ПланРабот;
			Движение.Номенклатура 		= СтрТЗ.Номенклатура;
			Движение.Цена 				= СтрТЗ.Цена;
			Движение.ЦенаФОТ 			= СтрТЗ.ЦенаФОТ;
			// ресурс
			Движение.Количество 		= СтрТЗ.Количество;
			// реквизит
			Движение.Месяц 				= НачалоМесяца(Дата);
			Движение.Скидка				= СтрТЗ.Скидка;
			
		КонецЦикла;
		
			ОстаткиПоПлануТиражныхРабот = ОстаткиПоПлануТР(  );
			Для Каждого Остаток ИЗ ОстаткиПоПлануТиражныхРабот Цикл
				Сообщение = Новый СообщениеПользователю;
		        Сообщение.Текст = "Не хватает " + (-Остаток.Остаток)+ " " + Остаток.Номенклатура.ЕдиницаИзмерения + " " + Остаток.Номенклатура + ", по цене "+ Остаток.Цена + 
				" (Цена ФОТ " + Остаток.ЦенаФОТ + ")";
		        Сообщение.Сообщить();
				
				//
				Если НЕ УП_ПереносДанных.ПроведениеПриПереносе() Тогда
					Отказ = Истина;      
				КонецЕсли;		
				
			КонецЦикла;
			
	Иначе
		Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "В документе " + Ссылка + ", в акте ТП не заполнен план работ";
        Сообщение.Сообщить();
		
	КонецЕсли;
	// записываем проведение	
	Движения.Записать();
	

КонецПроцедуры
